test/bench/evidence/20260713-0312-f58d16f87/g_direct_write_1m-linux-r2.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.301586] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=directwrite rw=write bs=1M nj=1 fsync=0 size=1G
P9CASE direct-write
p9dwrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread
p9dwrite: Laying out IO file (1 file / 1024MiB)
Jobs: 1 (f=1)
p9dwrite: (groupid=0, jobs=1): err= 0: pid=100: Mon Jul 13 03:13:48 2026
  write: IOPS=1174, BW=1174MiB/s (1231MB/s)(1024MiB/872msec); 0 zone resets
    clat (usec): min=307, max=2220, avg=811.73, stdev=258.15
     lat (usec): min=323, max=2281, avg=849.80, stdev=267.34
    clat percentiles (usec):
     |  1.00th=[  322],  5.00th=[  404], 10.00th=[  510], 20.00th=[  644],
     | 30.00th=[  709], 40.00th=[  734], 50.00th=[  775], 60.00th=[  824],
     | 70.00th=[  873], 80.00th=[  979], 90.00th=[ 1106], 95.00th=[ 1287],
     | 99.00th=[ 1647], 99.50th=[ 1827], 99.90th=[ 2147], 99.95th=[ 2212],
     | 99.99th=[ 2212]
   bw (  MiB/s): min= 1094, max= 1094, per=93.16%, avg=1094.00, stdev= 0.00, samples=1
   iops        : min= 1094, max= 1094, avg=1094.00, stdev= 0.00, samples=1
  lat (usec)   : 500=9.77%, 750=33.98%, 1000=38.28%
  lat (msec)   : 2=17.68%, 4=0.29%
  cpu          : usr=5.28%, sys=3.79%, ctx=1031, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1174MiB/s (1231MB/s), 1174MiB/s-1174MiB/s (1231MB/s-1231MB/s), io=1024MiB (1074MB), run=872-872msec
P9DONE direct-write
P9ALLDONE
[    2.352618] reboot: Power down